# PANDAS

pandas (all lowercase) is a popular python- based data analysis toolkit which can be imported using import pandas as pd. it presents a diverse range of utilities , raging from parsing multiple file format to converting an entire data table into a NumPy matrix array .This makes pandas a trusted ally data science and machine learning

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
ser = pd.Series()
ser
#print('{\n}'.format(ser))

Series([], dtype: float64)

In [3]:
ser = pd.Series([0, 10, 20, 30, 40, 50, 60, 70, 80, 90])
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [4]:
#Notice datatype
ser = pd.Series([20,15.7,'Amit'])
ser

0      20
1    15.7
2    Amit
dtype: object

In [5]:
#creat dictonary
dict = {'A':[1,2,3],'b':[5,8,9],'c':[1,2,3]}

In [6]:
df = pd.DataFrame(dict)

In [7]:
df

   A  b  c
0  1  5  1
1  2  8  2
2  3  9  3

In [8]:
#add new column and add values into it
df['D'] = "one two ten".split()

In [9]:
df

   A  b  c    D
0  1  5  1  one
1  2  8  2  two
2  3  9  3  ten

In [10]:
df['E'] = [10,25,50]
df

   A  b  c    D   E
0  1  5  1  one  10
1  2  8  2  two  25
2  3  9  3  ten  50

In [11]:
#how to creat NaN values and its manipulation
dict = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3],'D':[20,25,35]}

In [12]:
df = pd.DataFrame(dict)
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  25
2  NaN  NaN  3  35

In [13]:
print("\nDropping any column with nan value\n",'-'*35)
print(df.dropna(axis=1))

Dropping any column with nan value
 -----------------------------------
   C   D
0  1  20
1  2  25
2  3  35

In [14]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  25
2  NaN  NaN  3  35

In [15]:
print("\nDropping any rows with nan value\n",'-'*35)
print(df.dropna(axis=0))

Dropping any rows with nan value
 -----------------------------------
     A    B  C   D
0  1.0  5.0  1  20

In [16]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  25
2  NaN  NaN  3  35

In [17]:
print("\nFilling values with a default value\n",'-'*35, sep='')
print(df.fillna(value=50))

Filling values with a default value
-----------------------------------
      A     B  C   D
0   1.0   5.0  1  20
1   2.0  50.0  2  25
2  50.0  50.0  3  35

In [18]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  25
2  NaN  NaN  3  35

In [19]:
print("\nFilling values with a computrd value (mean of column c here)\n","-"*60,sep='')
df.fillna(value=df['C'].mean(),inplace=True)
print(df)

Filling values with a computrd value (mean of column c here)
------------------------------------------------------------
     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  25
2  2.0  2.0  3  35

In [20]:
df

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  25
2  2.0  2.0  3  35

In [21]:
#creat DataFrame
data = {'Company':['Goog','Goog','Msft','Msft','Fb','Fb'],
       'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales': [200,120,340,124,243,350],
       'Profit': [40,24,68,24,13,70]}
df=pd.DataFrame(data)
df

  Company   Person  Sales  Profit
0    Goog      Sam    200      40
1    Goog  Charlie    120      24
2    Msft      Amy    340      68
3    Msft  Vanessa    124      24
4      Fb     Carl    243      13
5      Fb    Sarah    350      70

**Groupby**

In [22]:
avg_sale = df.groupby('Company',as_index = False)['Sales'].mean()  #as index=False = to print index
print("\nGrouping by 'Company' column and listing mean sales\n","-"*55)
print(avg_sale)

Grouping by 'Company' column and listing mean sales
 -------------------------------------------------------
  Company  Sales
0      Fb  296.5
1    Goog  160.0
2    Msft  232.0

In [23]:
total_sales = df.groupby('Company')[['Sales','Profit']].sum()
print("\nGrouping by 'Company' column and listing mean sales\n","-"*55)
print(total_sales)

Grouping by 'Company' column and listing mean sales
 -------------------------------------------------------
         Sales  Profit
Company
Fb         593      83
Goog       320      64
Msft       464      92

In [24]:
sales_stats = df.groupby('Company')[['Sales','Profit']].agg(['mean','sum'])
print("\nGrouping by 'Company' column and both sum and avarage  sales\n","-"*55)
print(sales_stats)

Grouping by 'Company' column and both sum and avarage  sales
 -------------------------------------------------------
         Sales      Profit
          mean  sum   mean sum
Company
Fb       296.5  593   41.5  83
Goog     160.0  320   32.0  64
Msft     232.0  464   46.0  92

In [25]:
#Finding the largest value in each group . This produs sales and currosponding index
df.groupby('Company')['Sales'].nlargest(1)  #(1) is top 1

Company
Fb       5    350
Goog     0    200
Msft     2    340
Name: Sales, dtype: int64

**similarly you can check "nsmallest(1)"**

**Let's Learn about**

**-Concat**

**-Merge**

**-join**

**Concating DataFrames**

In [26]:
#creating Dataframes
Class_a = pd.DataFrame({'Mat': [45,68,35,65],
                        'Eng': [54,87,36,52],
                        'Sci': [66,77,88,70],
                        'Chem': [54,79,58,76]},
                     index = ['Ravi','Syam','Farhad','Abhi'])
Class_a

        Mat  Eng  Sci  Chem
Ravi     45   54   66    54
Syam     68   87   77    79
Farhad   35   36   88    58
Abhi     65   52   70    76

In [27]:
#creating Dataframes
Class_b = pd.DataFrame({'Mat': [50,87,69,71],
                        'Eng': [66,50,87,69],
                        'Sci': [34,66,69,71],
                        'Chem': [56,87,34,66]},
                     index = ['Shan','Mahi','Viru','Mona'])
Class_b

      Mat  Eng  Sci  Chem
Shan   50   66   34    56
Mahi   87   50   66    87
Viru   69   87   69    34
Mona   71   69   71    66

In [28]:
#creating Dataframes
Class_c = pd.DataFrame({'Mat': [66,50,87,56],
                        'Eng': [56,87,89,71],
                        'Sci': [77,88,70,52],
                        'Chem': [34,56,56,87]},
                     index = ['Astha','Rohit','Rahul','Shital'])
Class_c

        Mat  Eng  Sci  Chem
Astha    66   56   77    34
Rohit    50   87   88    56
Rahul    87   89   70    56
Shital   56   71   52    87

In [29]:
#concatination
all_student_marks = pd.concat([Class_a,Class_b,Class_c], axis=0)

print("\nAfter Concatination along row\n","-"*30, sep='')

print(all_student_marks)

After Concatination along row
------------------------------
        Mat  Eng  Sci  Chem
Ravi     45   54   66    54
Syam     68   87   77    79
Farhad   35   36   88    58
Abhi     65   52   70    76
Shan     50   66   34    56
Mahi     87   50   66    87
Viru     69   87   69    34
Mona     71   69   71    66
Astha    66   56   77    34
Rohit    50   87   88    56
Rahul    87   89   70    56
Shital   56   71   52    87

**Merge**

In [30]:
player_id_name = pd.DataFrame({
    'ID':[25,30,35,40,45,50,55],
    'Name': ['Ronaldo','Messi','Pele','Maradona','Harry','Pogba','Chhetri'],
})
print('Player ID and Names \n================= ')
player_id_name

Player ID and Names
=================

   ID      Name
0  25   Ronaldo
1  30     Messi
2  35      Pele
3  40  Maradona
4  45     Harry
5  50     Pogba
6  55   Chhetri

In [31]:
player_details = pd.DataFrame({
    'ID':[25,30,45,50,55],
    'Age':[36,34,28,28,37],
    'Country':['Portugal','Argentina','England','France','India']
})
print('players_details \n================= ')
player_details

players_details
=================

   ID  Age    Country
0  25   36   Portugal
1  30   34  Argentina
2  45   28    England
3  50   28     France
4  55   37      India

In [32]:
print=("===Database will be merged based on the matching ID's========= ")
pd.merge(player_id_name, player_details,on='ID')

   ID     Name  Age    Country
0  25  Ronaldo   36   Portugal
1  30    Messi   34  Argentina
2  45    Harry   28    England
3  50    Pogba   28     France
4  55  Chhetri   37      India

**Join**

In [33]:
#join operators
left = pd.DataFrame({'A': ['A0','A1','A2'],
                     'B': ['B0','B1','B2']},
                     index= ['K0','K1','K2'])
right = pd.DataFrame({'C': ['C0','C2','C3'],
                      'D': ['D0','D2','D3']},
                     index = ['K0','K2','K3'])

In [34]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [35]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [36]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [37]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3